---
kind: property
id: P:Autodesk.Revit.DB.Structure.TrussMemberInfo.lockedToTruss
source: html/b5ad4173-f5af-9c3f-184f-6b0e9889ab72.htm
---
# Autodesk.Revit.DB.Structure.TrussMemberInfo.lockedToTruss Property

Whether the member is locked to the host truss.

## Syntax (C#)
```csharp
public bool lockedToTruss { get; set; }
```